{"_type": "playlist", "id": "DNlTNK1sBZI", "title": "Post by unusualwhales", "description": "The Fed will begin cutting interest rates in September as labor market weakens, per Nomura\n\nVanguard suggests a 70% bond 30% stock portfolio for the next decade\n\nCorporate bankruptcies this summer have surged to their highest levels since 2020, per BI\n\n#ad Osisko Development (ODV) is on a mission to become North America’s next mid-tier gold producer—with three prospective projects across Canada, the US, and Mexico.\nTheir flagship Cariboo Gold project in BC is permitted and targeting ~190,000 oz/year over 10 years. At $2,400/oz gold, the NPV hits C$943M—and at $3,300/oz, it jumps to C$2.1B. Project financing efforts are underway to move this project into construction.\n\nIn Utah, the Tintic Project is turning heads with a small but high-grade underground resource at Trixie with samples over 4,700 g/t gold. And in Mexico, the San Antonio project offers restart or JV potential with a near-surface oxide resource.\n\nBacked by the team behind Canada’s largest gold mine (and top 10 globally), Osisko has scale, permits, and high-grade upside—all in tier-one jurisdictions. #ad\n\nThoughts?\n\nFollow @unusualwhales for daily posts about the stock market and crypto📈\n\nNOTE: Unusual Whales is not responsible for any promotion or #ad. Nor does Unusual Whales recommend any security. It does not verify the authenticity of the promotion or partnership, nor the merits of the individual promotion. Unusual Whales does not necessarily endorse or condone any one promotion. Unusual Whales does not advocate for any sponsor. Please do your own diligence and research before following any one promoted post. Do not consider a promotion of a post an advocacy for the sponsor of the post.", "timestamp": 1755705752, "channel": "unusualwhales", "uploader": "Unusual Whales 🐳", "uploader_id": "35553152276", "like_count": 4832, "comment_count": 271, "http_headers": {"Referer": "https://www.instagram.com/"}, "webpage_url": "https://www.instagram.com/p/DNlTNK1sBZI/?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==", "webpage_url_basename": "DNlTNK1sBZI", "webpage_url_domain": "instagram.com", "extractor": "Instagram", "extractor_key": "Instagram", "upload_date": "20250820", "playlist_count": 7, "epoch": 1755906702, "_version": {"version": "2025.08.20", "release_git_head": "c2fc4f3e7f6d757250183b177130c64beee50520", "repository": "yt-dlp/yt-dlp"}}