{"id": "DNrmXkFWm3U", "title": "Post by thelegendsofmusic", "description": "Promotional Footage of Ian Dury and the Blockheads performing “Sex & Drugs and Rock ’N’ Roll” on Dutch TV Show “Top Pop”\n\n“Sex & Drugs & Rock ’N’ Roll” was the first single release by Ian Dury, and has since become an anthem. His solo debut album New Boots And Panties!! was released a month later without including the single. Ian felt that including singles on subsequent albums was cheating the fans who already bought the single. “Sex and Drugs...” and the album were released as a Dury solo effort as he didn’t have a proper backing band yet. On the following tour, now with a full band, his backing band was named The Blockheads after a song on the album. Later releases were subsequently released as Ian Dury & The Blockheads. Dury wrote lyrics on A4 paper and presented them in a pile to his songwriting partner Chas Jankel to pick from. Jankel consistently passed on “Sex and Drugs” as he found the title a cliché. As he eventually read the entire lyrics and one day heard Dury humming the melody to the riff of the song, he started working on it. Jankel later found out that Dury had lifted the melody from a bass line by bass player Charlie Haden on a jazz album by Ornette Coleman.\n\n“Sex and Drugs and Rock And Roll” has since become a commonly used expression in popular culture, but the song is not about rock star excess as the title may indicate, but about living a life outside the norm. In a 1995 interview with Unpublished, Dury explained: “’Sex And Drugs’ started as a mild admonishment and ended as a lovely anthem. There was a time when I got fed up with it, but it got a new lease of life. When me and Jankel wrote this song we stole the riff from a Charlie Haden bass solo on a 1960 Ornette Coleman album called Change Of The Century. I met Charlie Haden later and he told me that he’d nicked the riff too, from a Cajun folk tune! It was banned by the BBC when we released it as a single but it sold about 18,000 copies. With this song I was trying to suggest there was more to life than either of those three - sex, drugs and rock’n’roll, or pulling a lever all day in a factory.” \n\n#Music #RockNRoll #IanDuryAndTheBlockheads #IanDury", "_type": "playlist", "webpage_url": "https://www.instagram.com/p/DNrmXkFWm3U/?img_index=2&igsh=ZTFqYTFldjl6Mndt", "webpage_url_basename": "DNrmXkFWm3U", "webpage_url_domain": "instagram.com", "extractor": "Instagram", "extractor_key": "Instagram", "playlist_count": 3, "epoch": 1755919068, "_version": {"version": "2025.08.20", "release_git_head": "c2fc4f3e7f6d757250183b177130c64beee50520", "repository": "yt-dlp/yt-dlp"}}